{
  "assistant_directors_list": [
    {
      "name": "Maximilian Goetz",
      "title_pronouns": "Board Chairman/President, Founder (he/him)",
      "description": "Maximilian Goetz is a junior at Georgetown University, where he is majoring in Business and Global Affairs and minoring in Computer Science. He is originally from Palo Alto, California, and is an aspiring business strategist. As a freshman in high school, he envisioned the idea of a youth-led organization dedicated to closing the opportunity gap . From there, he built Robotics For All from the ground up, teaching its first classes and eventually expanding it into a nationwide 501(c)(3) nonprofit organization with both in-person and virtual classes. He served as CEO until December 2021 and remains at Robotics For All as president of the board. At Georgetown, Maximilian is a project manager for two consulting clubs (Georgetown Marketing Association and DCivitas nonprofit consulting) and is a campus tour guide. He has interned in business strategy and marketing at several startups, including Savi Solutions, Talentsteps GmbH and Limber Health. Maximilian is honored to be a two-time TEDx speaker. In his free time, he is an avid aviation geek, enjoys traveling and recreational biking",
      "image": "https://ucarecdn.com/aba3949d-da3d-4b63-bfbd-7915c65423b7/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Garrett Tieng",
      "title_pronouns": "Board Secretary (he/him)",
      "description": "Garrett Tieng is a junior at Case Western Reserve University, studying aerospace and mechanical engineering. He joined in November 2017 as teacher and was promoted to lead instructor before becoming vice president in June 2018. Garrett helped develop several early in-person curricula including Lego Builders, Lego Robotics, and Arduino Explorers curricula. He led the development of online curricula as well, including Code.org, Python, and Scratch. Outside of Robotics for All, Garrett was a co-captain of an internationally awarded Botball robotics team. In his free time, Garrett enjoys exercising, playing table-top games, and writing stories. Garrett.tieng.net",
      "image": "https://ucarecdn.com/a2d9fa6f-4bc9-404e-a5c1-5311525f9b08/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Aarushi Khandelwal",
      "title_pronouns": "Board Treasurer (she/her)",
      "description": "t﻿bd...",
      "image": "https://ucarecdn.com/360159b9-b79d-44a5-904d-5d4b5b18eb1a/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Chris Langlois",
      "title_pronouns": "Board Member (he/him)",
      "description": "Chris Langlois is passionate about STEM education and teaching and has a history of volunteering with organizations that further these causes. He has an educational background in software and electrical engineering and loves to see young people get excited about engineering. Chris joined Robotics for All in 2021 as a Lead Instructor before transitioning to Chief Executive Officer in 2022. In his free time he enjoys cycling, swimming, running, programming, and spending time with family and friends.",
      "image": "https://ucarecdn.com/ea881c18-f0a1-4b33-8c3b-f36d39b2c200/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Kenneth Meng ",
      "title_pronouns": "Board Member (he/him) ",
      "description": "Kenneth Meng is an sophmore at Purdue University. He joined Robotics For All in January 2019 as a teacher, and became a board member in March 2020. He was appointed as the Director of Curriculum in July 2020. In his free time, he enjoys baking, cooking, and playing Stardew Valley.",
      "image": "https://ucarecdn.com/a16bfdf2-c800-493d-ae80-9b6dee3bb06f/-/scale_crop/400x400/smart/"
    }
  ]
}