{
  "board_members_list": [
    {
      "name": "Chris Langlois",
      "title_pronouns": "President and Chief Executive Officer (he/him)",
      "description": "Chris Langlois is passionate about STEM education and teaching and has a history of volunteering with organizations that further these causes. He has an educational background in software and electrical engineering and loves to see young people get excited about engineering. Chris joined Robotics for All in 2021 as a Lead Instructor before transitioning to Chief Executive Officer in 2022. In his free time he enjoys cycling, swimming, running, programming, and spending time with family and friends.",
      "image": "https://ucarecdn.com/aeac1506-18ff-4d8d-bff2-49ffff15ef93/-/scale_crop/400x400/smart/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Garrett Tieng ",
      "title_pronouns": "COO and Vice President (he/him) ",
      "description": "Garrett Tieng is a junior at Case Western Reserve University, studying aerospace and mechanical engineering. He joined in November 2017 as teacher and was promoted to lead instructor before becoming vice president in June 2018. Garrett helped develop several early in-person curricula including Lego Builders, Lego Robotics, and Arduino Explorers curricula. He led the development of online curricula as well, including Code.org, Python, and Scratch. Outside of Robotics for All, Garrett was a co-captain of an internationally awarded Botball robotics team. In his free time, Garrett enjoys exercising, playing table-top games, and writing stories. Garrett.tieng.net",
      "image": "https://ucarecdn.com/86b845e5-d418-4d35-bef1-6bf01b7b19e2/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Jack Wang",
      "title_pronouns": "CFO and Treasurer (he/him)",
      "description": "Jack Wang is a senior at Mission San Jose High School. He joined Robotics For All in June 2020 as a teacher's assistant, and later became a lead instructor for the Python course. In December of 2021, he became the CFO. In his free time, he enjoys studying for physics competitions and watching anime.",
      "image": "https://ucarecdn.com/c108610b-f2ac-4f80-aa85-4edee73a591a/-/crop/457x470/0,139/-/preview/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Crystal Lee",
      "title_pronouns": "​Director of Publicity (she/her)",
      "description": "Crystal Lee is a current junior and lives in the Bay Area. She joined Robotics For all as an intern in 2020, and in November of 2020 she became the Director of Publicity. Outside of publicity, she also heads the curriculum partnership initiative. Her other interests include volleyball, fashion design, and yearbook.",
      "image": "https://ucarecdn.com/1a9991ea-c6d6-42ca-94a2-b8adc93fcec0/-/crop/2400x2468/0,525/-/preview/-/scale_crop/400x400/smart/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Kenneth Meng",
      "description": "Kenneth Meng is an sophmore at Purdue University. He joined Robotics For All in January 2019 as a teacher, and became a board member in March 2020. He was appointed as the Director of Curriculum in July 2020. In his free time, he enjoys baking, cooking, and playing Stardew Valley.",
      "title_pronouns": "Director of Curriculum (he/him)",
      "image": "https://ucarecdn.com/8e6ace28-4f13-4ad2-8522-cd7fc873951d/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Ameya Ravi",
      "title_pronouns": "Director of Intern Operations (she/her)",
      "description": "Ameya is a freshman at Washington High School in Fremont, California. She joined Robotics For All as a business development intern in 2021, and worked in multiple tasks (including leading an intern group) before joining the leadership team as Director of Intern Operations. When she’s not working, Ameya enjoys dancing, pursuing musical interests, writing, and spending time with family.",
      "image": "https://ucarecdn.com/88ecc685-1e7b-485e-86e0-20a0c13b4e74/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Victoria Tsai ",
      "description": "Victoria Tsai is a senior at Atholton High School in Clarksville, MD. She joined Robotics for All as a teacher in 2020. She is also the Founder and President of Crafts for Charity and serves as a CFC Representative. Victoria also serves on the publicity committee as Director of Graphic Design. She enjoys making arts and crafts, participating in Science Olympiad and engineering!",
      "title_pronouns": "Director of Coordination and Crafts for Charity Representative (she/her)",
      "image": "https://ucarecdn.com/3c0f7444-8862-40da-ac28-cfd9c97b977d/-/scale_crop/400x400/smart/"
    },
    {
      "name": "Rishin Chatterjee",
      "title_pronouns": "Director of Recruitment (he/him)",
      "description": "Rishin Chatterjee is a High School Senior from Long Island, New York. He joined Robotics for All in November 2020 as a business development intern. Since then, he has worked in many areas of the organization including recruitment, finance, and publicity. He has taught classes in Scratch and Lego Explorers as Lead Teacher. Prior to becoming the the Director of Recruitment, he was the Head of Fundraising and Grants. In his free time, he enjoys playing tennis and golf.",
      "image": "https://ucarecdn.com/09684f8c-404c-4555-b436-2f6f5347516e/-/preview/-/scale_crop/400x400/smart/-/scale_crop/400x400/smart/"
    }
  ]
}