{
  "curriculum_developer_details": "Curriculum Development Interns at Robotics For All are in charge of developing new curricula for our classes. They allow our organization run classes on standardized curriculum, maximizing the class quality and greatly assisting teachers. Interns are assigned to either create or improve a specific curriculum. This is the perfect opportunity for anyone who is interested in computer science or education! High school and college students are welcome to apply.\n\n\n\n<!--StartFragment-->\n\n**Internship Information**​\n\n* This internship runs until the curriculum is finished. Most of the time, this will take roughly 3-5 months and interns may stop working with us early if they would like to.\n* We will support interns in many ways including:\n\n  * Providing training/orientation on how to develop each part of curriculum\n  * Assigning interns to two mentors who will assist them (a Curriculum Lead and an Intern Lead).\n  * Providing formal feedback at various intervals.​\n  * ​Organizing social activities with other interns and volunteers\n* There will also be various sub-tasks available for all interns to work on during every internship, if interns would like to commit to additional responsibilities.\n\n<!--EndFragment-->\n\n<!--StartFragment-->\n\n**Beneficial Qualifications**\n\n* Having experience in any of the following will be highly useful for these tasks:\n\n  * Strong communication and organization skills\n  * The ability to work effectively in a team\n  * Strong work ethic and responsibility\n  * Strong planning and critical thinking skills\n  * Google Drive, Docs, Slides, and other related web applications\n  * Prior experience with Curriculum Development or Education\n  * Teaching experience\n\n<!--EndFragment-->",
  "positions": [
    {
      "name": "Onshape Curriculum Developer ",
      "description": "<!--StartFragment-->\n\nOnshape curriculum developers will create the new 8-week CAD with Onshape curriculum to teach students new to CAD how to use the software. This curriculum will be targeted at 6th-8th graders and will be taught by Robotics For All’s volunteer teachers. It may include curriculum summaries, enrichment activities, and/or video lessons. \\\nApplicants must have a strong background with Computer-aided Design (CAD). They must also have substantial experience with Onshape. We will ask for a past project created in Onshape if you are moved to the interview phase of our process (a team or small project is fully acceptable; we just want to see that you have used the software before). \n\n<!--EndFragment-->"
    }
  ]
}