{
  "indlearners_bold_text": "Spring Enrollment is now closed.",
  "indlearners_body_text": "Want to sign up for a class at Robotics for All? Great! You've come to the right place!\n\nSince July 2020, Robotics for All has provided online courses for students from K- 8th grade. All classes are taught in English, run for eight weeks, and have virtual hour-long meetings with teachers once or twice a week​. Classes include live sessions over Zoom and optional homework. Students can ask their instructor questions through Google Classroom or email at any time. Each class will have a maximum student-instructor ratio of roughly 5:1. Our lead instructors are high school upperclassmen, college students, and college graduates. Teacher assistants are high school students and above.\n\nAll volunteers are carefully screened through a comprehensive written application and interview before being accepted. All volunteers over the age of 18 must pass a detailed background check run by our contractor [Sterling Volunteers](https://www.sterlingvolunteers.com/). Click here if you would like to **​[donate](https://www.roboticsforall.tk/donate)**.",
  "schools_bold_text": "Talk to us about our programs!",
  "schools_body_text": "Since July 2020, Robotics for All has provided online courses for students from K- 8th grade. We are now offering our classes to schools and partner organizations. Partner organizations may teach our curriculum and receive training from our curriculum team or have Robotics for All teachers teach the classes. All of our curriculum for partnered organizations can be taught in-person. Please contact us for more detail on training, logistics, and acquiring kits.\n\nPartners may select one of our suggested courses under \"Course Offerings\" (below) or may run any course that is on our full syllibus (bottom of page).\n\nOur curriculum generally includes 16 one-hour classes that are typically taught twice a week for 8 weeks. You may teach the classes as frequently as needed. Start and end dates are flexible."
}