{
  "technical_path": "Technical Interns work on a Software Development Team. We are currently only looking for React Web Development Interns to join this team and basic experience with React Web Development is required for this position. These volunteers will work on creating a new website for Robotics for All, complete with a basic CMS system. This internship starts within a few weeks of acceptance, and may not run on the standard internship schedule.",
  "time_commitment": "* 3-5 hours/week\n* ​Time commitment will vary depending on task, but most work can be done asynchronously and at flexible hours. \n* Interns will be able to use our Slack workspace as a primary source of communication, and must be able to check Slack at least every 24 hours.\n* Attend Weekly Team Meetings \n\n  * Each intern group will have **mandatory** weekly meetings to check in and discuss task progress. All meetings are scheduled with the Pacific Time and Eastern Time zones in mind. If you live outside of the US, please keep this time difference in mind.",
  "general_business_path": "Business Development Interns work on all tasks focused on the backend of Robotics For All. Some tasks include cold emailing, event planning, outreach, interviewing, and more. This is the best intern path for anyone who may not have as many technical skills or experiences, but is interested in working with our organization.",
  "scheduling": "Interns are assigned to work on a specific task. *Once interns have been accepted to one of our specific areas, interns will be able to show preference to whichever tasks they would like to work on, and will be assigned accordingly with a team with other volunteers to work on a particular task.* While we do our best to assign tasks based on your preference, this is not guaranteed. Technical Interns will be guaranteed the task that they apply for.",
  "beneficial_qualifications": "* Having experience in any of the following will be highly useful for all tasks, although each of our tasks will require different skill sets:\n\n  * Strong communication and organization skills\n  * The ability to work effectively in a team\n  * *Strong work ethic and responsibility*  \n  * Strong planning and critical thinking skills\n  * Experience with Google Drive, Docs, Slides, and other related web applications.",
  "requirments": "* Current High School or College Student (exceptions may be made, on rare occasion, for 8th graders with a volunteering background\n\n  * *College Graduates, we would still love to work with you! Please email rishin@roboticsforall.net if you are interested in working with us.* \n* Consistent access to a computer and stable internet​\n* Must be able to fully commit to a task and attend weekly meetings",
  "internpath": "Add Text",
  "overview": "Interns at Robotics for All are in charge of ensuring that our organization can continue to run. They fill many vital roles throughout the organization. Some of the most important tasks that Interns complete include curriculum development, cold emailing, interviewing, marketing work, and more. Interns are assigned to work on a specific task, and can choose from a variety of tasks. Although unpaid, interns will gain valuable insight into how a growing startup nonprofit organization runs. High school and college students are welcome to apply.",
  "curriculum": "fsdfdsf",
  "benefits": "* You will earn community service hours for all work done with the organization (this includes meetings and asynchronous work).\n* Interning at Robotics for All will look good on any resume, whether applying for a future internship, job, or college.\n* *​*Gain valuable insight into how a growing startup nonprofit organization runs\n* Potential future leadership opportunities (Robotics for All board, Team Lead, etc.) may be offered.\n* Experience the satisfaction of improving your local community.\n* Earn a recommendation letter from one of Robotics for All's leadership members",
  "publicity_path": "Publicity Interns work on all tasks focused on developing Robotics For All's public image. Some tasks include managing social media accounts, creating publicity content (graphics, banners, logos), and more. Experience with Graphic Design and/or Digital Illustration are required for this position"
}
