{
  "technical_path": "<!--StartFragment-->\n\nTechnical Interns work on a Software Development Team. We are currently only looking for React Web Development Interns to join this team and basic experience with React Web Development is required for this position.\\\n\\\nThese volunteers will work on creating a new website for Robotics for All, complete with a basic CMS system. \n\n<!--StartFragment-->\n\n**This internship starts within a few weeks of acceptance, and may not run on the standard internship schedule**\n\n<!--EndFragment-->\n\n<!--EndFragment-->",
  "time_commitment": "gsgfsd",
  "general_business_path": "<!--StartFragment-->\n\nBusiness Development Interns work on all tasks focused on the backend of Robotics For All. Some tasks include cold emailing, event planning, outreach, interviewing, and more.\\\n\\\nThis is the best intern path for anyone who may not have as many technical skills or experiences, but is interested in working with our organization.\n\n<!--EndFragment-->",
  "scheduling": "gsgfsd",
  "beneficial_qualifications": "gsgfsd",
  "requirments": "gsgfsd",
  "internpath": "gsgfsd",
  "overview": "<!--StartFragment-->\n\nInterns at Robotics For All are in charge of ensuring that our organization can continue to run. They fill many vital roles throughout the organization. Some of the most important tasks that Interns complete include curriculum development, cold emailing, interviewing, marketing work, and more. Interns are assigned to work on a specific task in 8-week cycles, and can choose from a variety of tasks. Interns at Robotics for All also help with two other branches of our organization, [Tutoring For All](https://www.tutoringforall.org/) and [Mentoring For All](https://www.mentoringforall.org/). Although unpaid, interns will gain valuable insight into how a growing startup nonprofit organization runs. High school and college students are welcome to apply.\n\n<!--EndFragment-->",
  "curriculum": "gsgfsd",
  "benefits": "gsgfsd",
  "publicity_path": "gsgfsd"
}