{
  "overview": "Publicity Interns work on all tasks focused on developing Robotics For All's public image. Some tasks include managing social media accounts, creating publicity content (graphics, banners, logos), and more.\n\nExperience with Graphic Design and/or Digital Illustration are required for this position.\n\n​Having experience in the following will be beneficial: \n\n* Fluency in a second language\n* ​Outreach\n* Search Engine Optimization\n* Creating publicity materials, including flyers,  advertisements, and social media posts\n* Managing social media business accounts\n* Video creation and/or editing experience",
  "positions": [
    {
      "header": "Graphic Design Interns ",
      "description": "**Overview**\n\nWe are seeking creative, innovative, and passionate individuals whose designs and marketing abilities can bolster the organization's branding. Graphic Design Interns are in charge of creating graphics and organizing them into polished instagram posts, flyers, and more. This position will work closely with our Head of Graphic Design and Director of Publicity. This is a great opportunity to get hands-on experience of a rapidly growing organization in a meaningful way!\n\n**Time Commitment**\n\n* 2-3 hours per week, varies depending on week\n\n**Responsibilities**\n\n* Use graphic design to create various assemblies of graphics.\n* Develop the assemblies to complete flyers, social media posts, and more. \n* Maintain consistency with Robotics for All’s brand image. \n\n**Requirements**\n\n* 2 -3 hours per week\n* Consistent access to a computer and stable WiFi\n* Current High School or College student\n\n**Beneficial Qualities**\n\n* Previous Social Media experience\n* Previous experience with graphic design software like Canva\n* Strong communication skills\n* Good at working with teams\n* Strong work ethic and responsibility\n* Well organized",
      "link": "https://forms.gle/iCEaJ3vAd9qRDS269"
    },
    {
      "header": "Account Managers",
      "description": "\n\n**Overview**\n\nThe Account Manager position helps run the new Curriculum Partnerships initiative. Curriculum Partnerships is one of our newest and fastest expanding programs. We are looking for interns to help manage partners under the Head of Curriculum Partnerships. They are responsible for outreach to partners, coordinating in-person classes, and managing the entirety of the partnership. This will require strong organizational skills, strong communication skills, and the ability to effectively work with autonomy. This role will be long-term, lasting a minimum of 4-6 months.\n\n**Time Commitment**\n\n* 3-5 hours per week\n* * Your responsibilities include outreach to partners, replying to questions, coordinating initial meetings with the partner, helping coordinate start and end dates for classes, and checking in with partners to make sure everything is running smoothly.\n* Weekly Meetings\n* * Meetings include brief updates with the Head of Curriculum Partnerships\n* Other meetings\n* * Shadowing initial meetings between the Head of Curriculum Partnerships and the partner\n\n\n\n**Responsibilities**\n\n* All tasks outlined (everything in blue boxes): [Curriculum Partnerships Workflow](https://docs.google.com/drawings/d/1Nxte8rZCWqQq_I_ofkB0TUwqSpKrOZeRweV-Ot_dspc/edit?usp=sharing)\n* * All in all an account manager’s job is to be the point person for partners from the beginning to the end of the partnership, answering any questions, coordinating kits, supporting teachers etc.. \n* Attend short weekly meetings with Head of Curriculum Partnerships \n\n**Requirements**\n\n* Strong organizational skill \n* Strong communication skills \n* Long-term commitment (4-6 months minimum) \n\n**Beneficial Qualities**\n\n* Previous Social Media experience\n* Previous experience with graphic design and illustration software\n* Strong communication skills\n* Good at working with teams\n* Strong work ethic and responsibility\n* Well organized",
      "link": "https://forms.gle/AJWymmRrAGkyKa2C6"
    }
  ]
}