{
  "overview": "<!--StartFragment-->\n\nThe teacher's assistant position is the perfect entry level position to teaching. As a teacher’s assistant, you will assist the lead instructor in teaching classes, answering student questions, and reviewing homework. You also may teach a breakout room of students.\n\n<!--EndFragment-->",
  "scheduling": "We start class sessions periodically (usually every few months). At the start of each session, accepted teacher's assistants may choose to volunteer in the class session. Although we do our best to administer classes efficiently, they are given based on teacher availability, position, and class interest. For that reason, it can take some time to get a class.\n\nClasses run on either a Monday/Thursday or Tuesday/Friday schedule, with times ranging from roughly 2:00 pm Pacific Time to 6:00 pm Pacific Time (5:00 pm Eastern Time to 9:00 pm Eastern Time).",
  "tasks": "<!--StartFragment-->\n\n* You will likely be in charge of leading a breakout room of approximately 3-5 students. \n* Help the lead instructor lead the two weekly synchronous classes (either on Monday/Thursday or Tuesday/Friday)\n\n  * ​The first weekly class is a live demo of concepts.\n  * The second weekly class is a review of student homework and a group discussion.\n* Review assignments posted onto Google Classroom and EdPuzzle, making sure the students complete them. \n* Answer students questions on a timely basis. \n\n<!--EndFragment-->",
  "curriculum": "\n\n* Our current curricula for online classes include the Code.org Curriculum (for K-3rd graders), Basic Scratch Curriculum (for K-3rd graders), Scratch Curriculum (for 4th-6th graders), Python Curriculum (for 6th-8th graders), and TinkerCAD Curriculum (for 5th-8th graders).\n* We have curricula for in person classes as well: Early Builders (with LEGO Motors and Pieces for 1st-3rd graders), LEGO Robotics (with LEGO Mindstorms EV3 for 4th-5th graders), mBot (with MakeBlock mot for 6th-7th graders), and Arduino (for 7th-8th graders).",
  "time_commitment": "<!--StartFragment-->\n\n* Teach one or multiple classes. \n\n  * Each class contains two hour long synchronous weekly class meetings (Monday/Thursday or Tuesday/Friday)\n  * Check homework and respond to student questions in between the classes. \n* Teach for the duration of at least one eight-week class session. \n\n<!--EndFragment-->",
  "benefits": "<!--StartFragment-->\n\n* Earn community service hours (teaching classes, responding to student questions, reviewing homework)\n* Teaching a Robotics for All class will look good on any resume, whether it is a future internship, job, or college.\n* Potential future leadership positions may be offered, including lead instructor and positions on Robotics for All’s Board of Directors.\n* Learn valuable leadership and teamwork skills.\n\n<!--EndFragment-->",
  "requirments": "<!--StartFragment-->\n\n* 8th grade in middle school or above (exceptions may be made to 6th-7th graders with a strong volunteering/teaching background​\n\n  * ​​Note: lead instructors must be **at least** two grade levels higher than the student of highest grade level in the class.​\n* Familiarity with the any of the platforms used for any of Robotics for All's curricula (Scratch, Python, CAD etc...)\n* Strong communication skills and the ability to work effectively in a team\n\n<!--EndFragment-->",
  "beneficial_qualifications": "<!--StartFragment-->\n\n* Experience teaching robotics classes\n* Past leadership or classroom management experience\n* Experience working with educational institutions\n\n<!--EndFragment-->"
}