{
  "overview": "Lead Instructors are responsible for running Robotics for All classes, managing Teacher Assistants, and checking student homework. They also must ensure that classes run smoothly by helping students with debugging, and addressing any issues with student behavior. Lead Instructors are the highest authority in the class, so they must possess strong leadership and independence.",
  "scheduling": "We start class sessions periodically (usually every few months). At the start of each session, accepted teachers may choose to volunteer in the class session. Classes are assigned based on teacher availability, position, and class interest. Please keep in mind that it can take some time to get paired with a class depending on your availability/interests.",
  "tasks": "* Teach students in synchronous classes \n* Manage any Teacher Assistants \n* Post and review homework assignments\n* Email and respond to emails from parents\n* Answer student questions in a timely manner",
  "curriculum": "Our current curricula for online classes includes Code.org Curriculum (for K-3rd graders), Basic Scratch Curriculum (for K-3rd graders), Scratch Curriculum (for 4th-6th graders), Python Curriculum (for 6th-8th graders), and TinkerCAD Curriculum (for 5th-8th graders). Please note that we are not currently accepting applications from people who only are interested in teaching Python.",
  "time_commitment": "* The total time commitment is 3 - 4 hours per week (or more if you choose to take on more than one class)\n* There are two, hour-long, synchronous classes per week.\n*  The rest of the time goes to checking homework and writing emails.",
  "benefits": "* We award community service hours. \n* Leading a Robotics for All class will look good on any resume, whether applying for a future internship, job, or college \n* Potential future leadership opportunities (Robotics for All board, etc.) may be offered.\n* Become part of a fun, welcoming community\n* Practical and fulfilling teaching experience",
  "requirments": "* Be in 10th grade or above (exceptions may be made to 9th graders with a strong background in teaching) \n* Mastery of one or more of the platforms that Robotics for All has curricula in",
  "beneficial_qualifications": "* Strong communication skills \n*  Good at working with teams\n* Prior teaching experience \n* Leadership or classroom management experience"
}