{
  "overview": "​**​**Technical Interns work on maintaining and improving the technological infrastructure of the organization. They can be a part of the software development or web development teams. \n\nThese volunteers will work on the new website for Robotics for All, complete with a basic CMS system.  \n\n**This internship starts within a few weeks of acceptance, and may not run on the standard internship schedule as detailed under \"Internship Information\".**\n\nHaving experience in the following will be beneficial:\n\n* Web Design Experience\n* General Programming Experience",
  "positions": [
    {
      "header": "Web Developer ",
      "link": "https://forms.gle/ravZBynZHMXANfSo8",
      "description": "\n\n**Overview**\n\nWe are seeking creative, innovative, and passionate individuals whose expertise in web development can make meaningful changes and improvements to the organization's website to bolster the organization's reach. This is a great opportunity to get hands-on experience of a rapidly growing organization in a meaningful way!\n\n**Time Commitment**\n\n* 2-3 hours per week, varies depending on week\n\n**Responsibilities**\n\n* Managing and maintaining the RFA website\n* Updating the website with new or changed information \n* Meeting and collaborating with the rest of the web development team\n\n**Requirements**\n\n* Previous experience with ReactJS, HTML, and/or CSS\n* Consistent access to a computer and stable WiFi\n* Current High School or College student\n\n**Beneficial Qualities**\n\n* Previous experience with CMS software like Netlify \n* Strong communication skills\n* Good at working with teams\n* Strong work ethic and responsibility\n* Well organized"
    },
    {
      "header": "Web Designer ",
      "link": "https://forms.gle/qhShqaFSEPFwU94j8",
      "description": "**Overview**\n\nWe are seeking creative, innovative, and passionate individuals whose expertise in web design can make meaningful graphical and visual improvements and updates to the organization's website to bolster the organization's reach. This is a great opportunity to get hands-on experience of a rapidly growing organization in a meaningful way!\n\n**Time Commitment**\n\n* 2-3 hours per week, varies depending on week\n\n**Responsibilities**\n\n* Collaborate with the web development team \n* Brainstorming and executing on unique ideas for the design of the website \n* Regular use of design software \n\n**Requirements**\n\n* Having an eye for design\n* Consistent access to a computer and stable WiFi\n* Current High School or College student\n\n**Beneficial Qualities**\n\n* Previous experience with design software like Canva\n* Strong communication skills\n* Good at working with teams\n* Strong work ethic and responsibility\n* Well organized"
    },
    {
      "header": "Software Developer Position",
      "link": "https://docs.google.com/forms/d/1wxCKAsj5VXZeBGJItHG-KWX-hSL3zIwAZRCjDWxMvII/edit",
      "description": "Overview\n\nA non-profit organization relies on a lot of software to ensure that all operations run smoothly. Robotics for All is seeking dedicated, talented, and hard-working individuals who will work on developing new software and fix issues and bugs with current software in order to improve efficiency. This is a great opportunity to get hands-on experience of a rapidly growing organization in a meaningful way!\n\nTime Commitment\n\n* 2-3 hours per week, varies depending on week\n\nResponsibilities\n\n*  Designing and developing new software for the organization to run smoothly\n* Making improvements to software based on feedback from various stakeholders \n* Updating existing and outdated software\n* Working on assigned asynchronous tasks \n* Having meetings with the software team lead\n\nRequirements\n\n* Previous experience with Python and HTML \n* Consistent access to a computer and stable Wi-Fi\n* Current High School or College student\n\n\n\nBeneficial Qualities\n\n* Strong communication skills\n* Good at working with teams\n* Strong work ethic and responsibility\n* Well organized"
    }
  ]
}