{
  "overview": "​**​**Technical Interns work on maintaining and improving the technological infrastructure of the organization. They can be a part of the software development or web development teams. \n\nThese volunteers will work on the new website for Robotics for All, complete with a basic CMS system.  \n\n**This internship starts within a few weeks of acceptance, and may not run on the standard internship schedule as detailed under \"Internship Information\".**\n\nHaving experience in the following will be beneficial:\n\n* Web Design Experience\n* General Programming Experience",
  "positions": [
    {
      "header": "UI/UX Designer",
      "link": "https://wkf.ms/3GUvrXj",
      "description": "Robotics For All (RFA) is seeking a passionate, creative, and experienced UI/UX Designer who can help redesign the website using industry-standard design practices. RFA wants to take our website to the next level by giving users a memorable experience, ultimately using the website to establish RFA as a unique company. The website is currently built using ReactJS and Bootstrap.\n\n\n\nTime Commitment\n\n* 4-5  hours per week, 4 - 6 months\n\n  * Participate in weekly meetings to assess progress\n  * Complete asynchronous tasks by deadlines\n\nResponsibilities\n\n* Employ creativity to help redesign from the ground up the look and feel of the website using industry standard design practices\n* Develop foundational components for future UI/UX work such as site mapping, color palettes, common reusable components (buttons, backgrounds, icons, etc.)\n* Use the website to establish RFA as a unique brand/theme\n* Work closely with the web development team to redesign the website\n\nRequirements\n\n* 2+ years of industry experience, particularly in designing web or mobile applications.\n* Extensive experience with Figma or similar design platform (All UI/UX work will be conducted in Figma)\n* Strong understanding of industry-standard design practices in web development: Wireframing, SEO, Accessibility, etc.\n* Worked in similar team roles, side by side with other developers\n* Strong understanding of HTML/CSS\n\nBeneficial Qualities\n\n* Experience developing websites through modern web development technologies\n* Familiarity working in environments such as ReactJS, Angular, Vue, and other web frameworks (website currently built with React and Bootstrap)\n* Familiarity with modern UI libraries\n* Strong communication skills, collaboration skills, work ethic, and responsibility\n* Strong creativity and big imagination\n* Well organized"
    }
  ]
}